"""
    Показать на экран таблицу умножения в диапазоне, указанном
    пользователем. Например, если пользователь указал 3 и 5, таблица может
    выглядеть так
    3*1 = 3 3*2 = 6 3*3 = 9 … 3 * 10 = 30
    .....................................................................
    5*1 = 5 5 *2 = 10 5 *3 = 15 ... 5 * 10 = 50
"""

num_1 = int(input("Enter a first number: "))
num_2 = int(input("Enter a second number: "))

for i in range(num_1, num_2 + 1):
    for j in range(1, 11):
        result = i * j
        print(f'{i} x {j} = {result}', end="\t\t")
    print("\n")
